[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:77:45
               id="reviewerEmail"
               type="text"
               isInvalid={Boolean(errors.reviewerEmail)}
-              {...register("reviewerEmail", {
-                required: true,
-                pattern: email_regex,
-              })}
+              {...register("reviewerEmail", {})}
             />
 
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Not a valid reviewer email/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReviews/MenuItemReviewForm.jsx:84:16
             />
 
             <Form.Control.Feedback type="invalid">
-              {errors.reviewerEmail?.type === "required"
+              {false
                 ? "reviewerEmail is required."
                 : null}
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /reviewerEmail is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/MenuItemReviews/MenuItemReviewForm.jsx:84:16
             />
 
             <Form.Control.Feedback type="invalid">
-              {errors.reviewerEmail?.type === "required"
+              {errors.reviewerEmail.type === "required"
                 ? "reviewerEmail is required."
                 : null}
killedBy: MenuItemReviewForm tests renders correctly
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
main/components/MenuItemReviews/MenuItemReviewForm.jsx:87:16
               {errors.reviewerEmail?.type === "required"
                 ? "reviewerEmail is required."
                 : null}
-              {errors.reviewerEmail?.type === "pattern"
+              {false
                 ? "Not a valid reviewer email."
                 : null}
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Not a valid reviewer email/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReviews/MenuItemReviewForm.jsx:87:16
               {errors.reviewerEmail?.type === "required"
                 ? "reviewerEmail is required."
                 : null}
-              {errors.reviewerEmail?.type === "pattern"
+              {true
                 ? "Not a valid reviewer email."
                 : null}
killedBy: MenuItemReviewForm tests No Error messsages on good input
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="invalid-feedback"
>
  Not a valid reviewer email.
</div> instead

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:88:19
                 ? "reviewerEmail is required."
                 : null}
               {errors.reviewerEmail?.type === "pattern"
-                ? "Not a valid reviewer email."
+                ? ""
                 : null}
             </Form.Control.Feedback>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Not a valid reviewer email/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReviews/MenuItemReviewForm.jsx:134:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.comments && "comments are required."}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /comments are required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReviews/MenuItemReviewForm.jsx:134:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.comments && "comments are required."}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /comments are required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReviews/MenuItemReviewForm.jsx:155:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateReviewed && "dateReviewed is required"}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /dateReviewed is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/MenuItemReviews/MenuItemReviewForm.jsx:155:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateReviewed && "dateReviewed is required"}
+              {errors.dateReviewed || "dateReviewed is required"}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Not a valid reviewer email/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
