[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewTable.jsx:62:20
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "MenuItemReviewTable"),
+      ButtonColumn("", "primary", editCallback, "MenuItemReviewTable"),
     );
     columns.push(
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Columns require an id when using a non-string header
