[Killed] ArrowFunction
main/pages/Articles/ArticleCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function ArticleCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (article) => ({
-    url: "/api/articles/post",
-    method: "POST",
-    params: {
-      title: article.title,
-      url: article.url,
-      explanation: article.explanation,
-      email: article.email,
-      dateAdded: article.dateAdded,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (article) => {
killedBy: ArticleCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
