[Killed] BlockStatement
main/pages/Articles/ArticleEditPage.jsx:43:34
     },
   });
 
-  const onSuccess = (article) => {
-    toast(`Article Updated - id: ${article.id}`);
-  };
+  const onSuccess = (article) => {};
 
   const mutation = useBackendMutation(
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] StringLiteral
main/pages/Articles/ArticleEditPage.jsx:44:11
   });
 
   const onSuccess = (article) => {
-    toast(`Article Updated - id: ${article.id}`);
+    toast(``);
   };
 
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "spy" to be called with arguments: [ 'Article Updated - id: 17' ]

Received: 

  1st spy call:

  [
-   "Article Updated - id: 17",
