[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewCreatePage.jsx:20:41
     },
   });
 
-  const onSuccess = (menuItemReview) => {
-    toast(
-      `New menuItemReview Created - itemId: ${menuItemReview.itemId} reviewerEmail: ${menuItemReview.reviewerEmail}`,
-    );
-  };
+  const onSuccess = (menuItemReview) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemReview tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0
