[Killed] ArrowFunction
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:28:34
     },
   );
 
-  const objectToAxiosPutParams = (menuitemreview) => ({
-    url: "/api/menuitemreview",
-    method: "PUT",
-    params: {
-      id: menuitemreview.id,
-    },
-    data: {
-      itemId: menuitemreview.itemId,
-      reviewerEmail: menuitemreview.reviewerEmail,
-      dateReviewed: menuitemreview.dateReviewed,
-      stars: menuitemreview.stars,
-      comments: menuitemreview.comments,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (menuitemreview) => {
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "MenuItemReview Updated - ItemId: 4 reviewerEmail: yorble@ucsb.edu",

[Killed] StringLiteral
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:29:10
   );
 
   const objectToAxiosPutParams = (menuitemreview) => ({
-    url: "/api/menuitemreview",
+    url: "",
     method: "PUT",
     params: {
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "MenuItemReview Updated - ItemId: 4 reviewerEmail: yorble@ucsb.edu",

[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:43:41
     },
   });
 
-  const onSuccess = (menuitemreview) => {
-    toast(
-      `MenuItemReview Updated - ItemId: ${menuitemreview.itemId} reviewerEmail: ${menuitemreview.reviewerEmail}`,
-    );
-  };
+  const onSuccess = (menuitemreview) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit MenuItemReview</h1>
-        {menuitemreview && (
-          <MenuItemReviewForm
-            initialContents={menuitemreview}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: MenuItemReviewEditPage tests tests where backend is working normally renders without crashing
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit MenuItemReview</h1>
-        {menuitemreview && (
-          <MenuItemReviewForm
-            initialContents={menuitemreview}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {menuitemreview || <MenuItemReviewForm initialContents={menuitemreview} submitAction={onSubmit} buttonLabel="Update" />}
       </div>
     </BasicLayout>
killedBy: MenuItemReviewEditPage tests tests where backend is working normally renders without crashing
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
