[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsCreatePage.jsx:10:31
 export default function UCSBDiningCommonsMenuItemsCreatePage({
   storybook = false,
 }) {
-  const objectToAxiosParams = (UCSBDiningCommonsMenuItems) => ({
-    url: "/api/ucsbdiningcommons/post",
-    method: "POST",
-    params: {
-      diningCommonsCode: UCSBDiningCommonsMenuItems.diningCommonsCode,
-      name: UCSBDiningCommonsMenuItems.name,
-      station: UCSBDiningCommonsMenuItems.station,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (UCSBDiningCommonsMenuItems) => {
killedBy: UCSBDiningCommonsMenuItemsCreatePage tests when you fill in the form and hit submit, it makes a request to the backend, redirects to /ucsbdiningcommons
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsCreatePage.jsx:20:53
     },
   });
 
-  const onSuccess = (UCSBDiningCommonsMenuItems) => {
-    toast(
-      `New UCSBDiningCommonsMenuItems Created - id: ${UCSBDiningCommonsMenuItems.id} name: ${UCSBDiningCommonsMenuItems.name}`,
-    );
-  };
+  const onSuccess = (UCSBDiningCommonsMenuItems) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemsCreatePage tests when you fill in the form and hit submit, it makes a request to the backend, redirects to /ucsbdiningcommons
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsCreatePage.jsx:39:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/ucsbdiningcommons" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: UCSBDiningCommonsMenuItemsCreatePage tests when you fill in the form and hit submit, it makes a request to the backend, redirects to /ucsbdiningcommons
statusReason: expected "spy" to be called with arguments: [ { to: '/ucsbdiningcommons' } ]

Number of calls: 0
