[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsEditPage.jsx:20:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/ucsbdiningcommons?id=${id}`],
-    {
-      // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-      method: "GET",
-      url: `/api/ucsbdiningcommons`,
-      params: {
-        id,
-      },
-    },
+    {},
   );
 
killedBy: UCSBDiningCommonsMenuItemsEditPage tests tests where backend is working normally renders without crashing
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemsForm-diningCommonsCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsEditPage.jsx:23:12
     {
       // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
       method: "GET",
-      url: `/api/ucsbdiningcommons`,
+      url: ``,
       params: {
         id,
killedBy: UCSBDiningCommonsMenuItemsEditPage tests tests where backend is working normally renders without crashing
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemsForm-diningCommonsCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsEditPage.jsx:30:34
     },
   );
 
-  const objectToAxiosPutParams = (UCSBDiningCommonsMenuItems) => ({
-    url: "/api/ucsbdiningcommons",
-    method: "PUT",
-    params: {
-      id: UCSBDiningCommonsMenuItems.id,
-    },
-    data: {
-      diningCommonsCode: UCSBDiningCommonsMenuItems.diningCommonsCode,
-      name: UCSBDiningCommonsMenuItems.name,
-      station: UCSBDiningCommonsMenuItems.station,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (UCSBDiningCommonsMenuItems) => {
killedBy: UCSBDiningCommonsMenuItemsEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "UCSBDiningCommonsMenuItems Updated - id: 17 name: pasta",

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsEditPage.jsx:30:67
     },
   );
 
-  const objectToAxiosPutParams = (UCSBDiningCommonsMenuItems) => ({
-    url: "/api/ucsbdiningcommons",
-    method: "PUT",
-    params: {
-      id: UCSBDiningCommonsMenuItems.id,
-    },
-    data: {
-      diningCommonsCode: UCSBDiningCommonsMenuItems.diningCommonsCode,
-      name: UCSBDiningCommonsMenuItems.name,
-      station: UCSBDiningCommonsMenuItems.station,
-    },
-  });
+  const objectToAxiosPutParams = (UCSBDiningCommonsMenuItems) => ({});
 
   const onSuccess = (UCSBDiningCommonsMenuItems) => {
killedBy: UCSBDiningCommonsMenuItemsEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "UCSBDiningCommonsMenuItems Updated - id: 17 name: pasta",

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsEditPage.jsx:43:53
     },
   });
 
-  const onSuccess = (UCSBDiningCommonsMenuItems) => {
-    toast(
-      `UCSBDiningCommonsMenuItems Updated - id: ${UCSBDiningCommonsMenuItems.id} name: ${UCSBDiningCommonsMenuItems.name}`,
-    );
-  };
+  const onSuccess = (UCSBDiningCommonsMenuItems) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemsEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsEditPage.jsx:45:7
 
   const onSuccess = (UCSBDiningCommonsMenuItems) => {
     toast(
-      `UCSBDiningCommonsMenuItems Updated - id: ${UCSBDiningCommonsMenuItems.id} name: ${UCSBDiningCommonsMenuItems.name}`,
+      ``,
     );
   };
killedBy: UCSBDiningCommonsMenuItemsEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "UCSBDiningCommonsMenuItems Updated - id: 17 name: pasta",

[Killed] ConditionalExpression
main/pages/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsEditPage.jsx:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBDiningCommonsMenuItems</h1>
-        {UCSBDiningCommonsMenuItems && (
-          <UCSBDiningCommonsMenuItemsForm
-            initialContents={UCSBDiningCommonsMenuItems}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: UCSBDiningCommonsMenuItemsEditPage tests tests where backend is working normally renders without crashing
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemsForm-diningCommonsCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsEditPage.jsx:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBDiningCommonsMenuItems</h1>
-        {UCSBDiningCommonsMenuItems && (
-          <UCSBDiningCommonsMenuItemsForm
-            initialContents={UCSBDiningCommonsMenuItems}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {UCSBDiningCommonsMenuItems || <UCSBDiningCommonsMenuItemsForm initialContents={UCSBDiningCommonsMenuItems} submitAction={onSubmit} buttonLabel="Update" />}
       </div>
     </BasicLayout>
killedBy: UCSBDiningCommonsMenuItemsEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input
  class="form-control"
  data-testid="UCSBDiningCommonsMenuItemsForm-diningCommonsCode"
  id="diningCommonsCode"
  name="diningCommonsCode"
  placeholder="ortega"
