[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsIndexPage.jsx:12:30
 export default function UCSBDiningCommonsMenuItemsIndexPage() {
   const currentUser = useCurrentUser();
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/ucsbdiningcommons/create"
-          style={{ float: "right" }}
-        >
-          Create UCSBDiningCommonsMenuItems
-        </Button>
-      );
-    }
-  };
+  const createButton = () => {};
 
   const {
killedBy: UCSBDiningCommonsMenuItemsIndexPage tests Renders with Create Button for admin user
statusReason: Unable to find an element with the text: /Create UCSBDiningCommonsMenuItems/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsIndexPage.jsx:13:45
   const currentUser = useCurrentUser();
 
   const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/ucsbdiningcommons/create"
-          style={{ float: "right" }}
-        >
-          Create UCSBDiningCommonsMenuItems
-        </Button>
-      );
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN")) {}
   };
 
killedBy: UCSBDiningCommonsMenuItemsIndexPage tests Renders with Create Button for admin user
statusReason: Unable to find an element with the text: /Create UCSBDiningCommonsMenuItems/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
