[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:59:38
               id="itemId"
               type="long"
               isInvalid={Boolean(errors.itemId)}
-              {...register("itemId", {
-                required: "ItemId is required.",
-                //valueAsNumber: true,
-                validate: (value) =>
-                  !isNaN(value) || "ItemId must be a valid number",
-                min: {
-                  value: 0,
-                  message: "ItemId must be greater than 0",
-                },
-              })}
+              {...register("itemId", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /ItemId must be a valid number/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ArrowFunction
main/components/MenuItemReviews/MenuItemReviewForm.jsx:62:27
               {...register("itemId", {
                 required: "ItemId is required.",
                 //valueAsNumber: true,
-                validate: (value) =>
-                  !isNaN(value) || "ItemId must be a valid number",
+                validate: () => undefined,
                 min: {
                   value: 0,
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /ItemId must be a valid number/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReviews/MenuItemReviewForm.jsx:63:19
                 required: "ItemId is required.",
                 //valueAsNumber: true,
                 validate: (value) =>
-                  !isNaN(value) || "ItemId must be a valid number",
+                  true,
                 min: {
                   value: 0,
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /ItemId must be a valid number/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReviews/MenuItemReviewForm.jsx:63:19
                 required: "ItemId is required.",
                 //valueAsNumber: true,
                 validate: (value) =>
-                  !isNaN(value) || "ItemId must be a valid number",
+                  false,
                 min: {
                   value: 0,
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /ItemId must be a valid number/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] EqualityOperator
main/components/MenuItemReviews/MenuItemReviewForm.jsx:91:16
             />
 
             <Form.Control.Feedback type="invalid">
-              {errors.reviewerEmail?.type === "required"
+              {errors.reviewerEmail?.type !== "required"
                 ? "reviewerEmail is required."
                 : null}
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /reviewerEmail is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:110:27
               type="int"
               isInvalid={Boolean(errors.stars)}
               {...register("stars", {
-                required: "stars are required.",
+                required: "",
                 validate: (value) =>
                   (value && !isNaN(value)) || "Stars must be a valid number",
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /stars are required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ArrowFunction
main/components/MenuItemReviews/MenuItemReviewForm.jsx:111:27
               isInvalid={Boolean(errors.stars)}
               {...register("stars", {
                 required: "stars are required.",
-                validate: (value) =>
-                  (value && !isNaN(value)) || "Stars must be a valid number",
+                validate: () => undefined,
 
                 min: {
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: Stars must be a valid number. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReviews/MenuItemReviewForm.jsx:112:19
               {...register("stars", {
                 required: "stars are required.",
                 validate: (value) =>
-                  (value && !isNaN(value)) || "Stars must be a valid number",
+                  false,
 
                 min: {
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: Stars must be a valid number. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:112:29
               {...register("stars", {
                 required: "stars are required.",
                 validate: (value) =>
-                  (value && !isNaN(value)) || "Stars must be a valid number",
+                  (value && isNaN(value)) || "Stars must be a valid number",
 
                 min: {
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: Stars must be a valid number. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:114:22
                 validate: (value) =>
                   (value && !isNaN(value)) || "Stars must be a valid number",
 
-                min: {
-                  value: 0,
-                  message: "Stars must be between 0-5",
-                },
+                min: {},
                 max: {
                   value: 5,
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: Stars must be between 0-5. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/MenuItemReviews/MenuItemReviewForm.jsx:143:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.comments && "comments are required."}
+              {errors.comments || "comments are required."}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Not a valid reviewer email/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
