[NoCoverage] ArrayDeclaration
main/components/RecommendationRequest/RecommendationRequestsTable.jsx:13:28
 import { hasRole } from "main/utils/useCurrentUser";
 
 export default function RecommendationRequestsTable({
-  recommendationRequests = [],
+  recommendationRequests = ["Stryker was here"],
   currentUser,
 }) {

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestsTable.jsx:38:36
 
   const columns = [
     { header: "id", accessorKey: "id" },
-    { header: "Code", accessorKey: "code" },
+    { header: "Code", accessorKey: "" },
     { header: "Requester Email", accessorKey: "requesterEmail" },
     { header: "Professor Email", accessorKey: "professorEmail" },
killedBy: RecommendationRequestsTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="RecommendationRequestsTable-cell-row-0-col-code"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecommendationRequestsTable"

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestsTable.jsx:38:15
 
   const columns = [
     { header: "id", accessorKey: "id" },
-    { header: "Code", accessorKey: "code" },
+    { header: "", accessorKey: "code" },
     { header: "Requester Email", accessorKey: "requesterEmail" },
     { header: "Professor Email", accessorKey: "professorEmail" },
killedBy: RecommendationRequestsTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element with the text: Code. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecommendationRequestsTable"

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestsTable.jsx:40:47
     { header: "id", accessorKey: "id" },
     { header: "Code", accessorKey: "code" },
     { header: "Requester Email", accessorKey: "requesterEmail" },
-    { header: "Professor Email", accessorKey: "professorEmail" },
+    { header: "Professor Email", accessorKey: "" },
     { header: "Explanation", accessorKey: "explanation" },
     { header: "Date Requested", accessorKey: "dateRequested" },
killedBy: RecommendationRequestsTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="RecommendationRequestsTable-cell-row-0-col-professorEmail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecommendationRequestsTable"

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestsTable.jsx:41:43
     { header: "Code", accessorKey: "code" },
     { header: "Requester Email", accessorKey: "requesterEmail" },
     { header: "Professor Email", accessorKey: "professorEmail" },
-    { header: "Explanation", accessorKey: "explanation" },
+    { header: "Explanation", accessorKey: "" },
     { header: "Date Requested", accessorKey: "dateRequested" },
     { header: "Date Needed", accessorKey: "dateNeeded" },
killedBy: RecommendationRequestsTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="RecommendationRequestsTable-cell-row-0-col-explanation"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecommendationRequestsTable"

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestsTable.jsx:44:5
     { header: "Explanation", accessorKey: "explanation" },
     { header: "Date Requested", accessorKey: "dateRequested" },
     { header: "Date Needed", accessorKey: "dateNeeded" },
-    {
-      header: "Done",
-      accessorKey: "done",
-      cell: ({ getValue }) => String(getValue()),
-    },
+    {},
   ];
 
killedBy: RecommendationRequestsTable tests Has the expected column headers and content for ordinary user
statusReason: Columns require an id when using a non-string header

[Survived] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestsTable.jsx:47:13
     {
       header: "Done",
       accessorKey: "done",
-      cell: ({ getValue }) => String(getValue()),
+      cell: () => undefined,
     },
   ];

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestsTable.jsx:51:43
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(
-      ButtonColumn(
-        "Edit",
-        "primary",
-        editCallback,
-        "RecommendationRequestsTable",
-      ),
-    );
-    columns.push(
-      ButtonColumn(
-        "Delete",
-        "danger",
-        deleteCallback,
-        "RecommendationRequestsTable",
-      ),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
   return (
killedBy: RecommendationRequestsTable tests Has the expected colum headers and content for adminUser
statusReason: Unable to find an element by: [data-testid="RecommendationRequestsTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecommendationRequestsTable"

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestsTable.jsx:57:9
         "Edit",
         "primary",
         editCallback,
-        "RecommendationRequestsTable",
+        "",
       ),
     );
killedBy: RecommendationRequestsTable tests Has the expected colum headers and content for adminUser
statusReason: Unable to find an element by: [data-testid="RecommendationRequestsTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecommendationRequestsTable"

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestsTable.jsx:65:9
         "Delete",
         "danger",
         deleteCallback,
-        "RecommendationRequestsTable",
+        "",
       ),
     );
killedBy: RecommendationRequestsTable tests Has the expected colum headers and content for adminUser
statusReason: Unable to find an element by: [data-testid="RecommendationRequestsTable-cell-row-0-col-Delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecommendationRequestsTable"
