[NoCoverage] ArrayDeclaration
main/pages/RecommendationRequest/RecommendationRequestIndexPage.jsx:13:36
   const currentUser = useCurrentUser();
 
   const {
-    data: recommendationRequests = [],
+    data: recommendationRequests = ["Stryker was here"],
     error: _error,
     status: _status,

[Killed] StringLiteral
main/pages/RecommendationRequest/RecommendationRequestIndexPage.jsx:18:27
     status: _status,
   } = useBackend(
     ["/api/recommendationrequests/all"], // query key
-    { method: "GET", url: "/api/recommendationrequests/all" },
+    { method: "GET", url: "" },
     [], // initial data
   );
killedBy: RecommendationRequestIndexPage tests renders three recommendation requests correctly for regular user
statusReason: Unable to find an element by: [data-testid="RecommendationRequestsTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/RecommendationRequest/RecommendationRequestIndexPage.jsx:18:5
     status: _status,
   } = useBackend(
     ["/api/recommendationrequests/all"], // query key
-    { method: "GET", url: "/api/recommendationrequests/all" },
+    {},
     [], // initial data
   );
killedBy: RecommendationRequestIndexPage tests renders three recommendation requests correctly for regular user
statusReason: Unable to find an element by: [data-testid="RecommendationRequestsTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/RecommendationRequest/RecommendationRequestIndexPage.jsx:27:10
   return (
     <BasicLayout>
       <div className="pt-2">
-        {isAdmin && (
-          <Button
-            variant="primary"
-            href="/recommendationrequests/create"
-            style={{ float: "right" }}
-          >
-            Create RecommendationRequest
-          </Button>
-        )}
+        {true}
         <h1>RecommendationRequest</h1>
         <RecommendationRequestsTable
killedBy: RecommendationRequestIndexPage tests Renders with Create Button for admin user
statusReason: Unable to find role="button" and name `/Create RecommendationRequest/i`

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/RecommendationRequest/RecommendationRequestIndexPage.jsx:27:10
   return (
     <BasicLayout>
       <div className="pt-2">
-        {isAdmin && (
-          <Button
-            variant="primary"
-            href="/recommendationrequests/create"
-            style={{ float: "right" }}
-          >
-            Create RecommendationRequest
-          </Button>
-        )}
+        {isAdmin || <Button variant="primary" href="/recommendationrequests/create" style={{
+  float: "right"
+}}>
+            Create RecommendationRequest
+          </Button>}
         <h1>RecommendationRequest</h1>
         <RecommendationRequestsTable
killedBy: RecommendationRequestIndexPage tests renders three recommendation requests correctly for regular user
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a
  class="btn btn-primary"
  href="/recommendationrequests/create"
  role="button"
  style="float: right;"
  tabindex="0"
