[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:28:10
   return (
     <Form noValidate onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">id</Form.Label>
-              <Form.Control
-                data-testid="RecommendationRequestForm-id"
-                id="id"
-                name="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {false}
         <Col>
           <Form.Group className="mb-3">
killedBy: RecommendationRequestForm tests renders correctly when passing in a RecommendationRequest
statusReason: Unable to find an element by: [data-testid="/RecommendationRequestForm-id/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:28:10
   return (
     <Form noValidate onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">id</Form.Label>
-              <Form.Control
-                data-testid="RecommendationRequestForm-id"
-                id="id"
-                name="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {true}
         <Col>
           <Form.Group className="mb-3">
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Unable to find a label with the text of: id

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:52:28
               id="code"
               type="text"
               isInvalid={Boolean(errors.code)}
-              {...register("code", {
+              {...register("", {
                 required: true,
               })}
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:77:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requesterEmail?.type === "required"
+              {true
                 ? "Requester email is required."
                 : null}
killedBy: RecommendationRequestForm tests No Error messsages on good input
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="invalid-feedback"
>
  Requester email is required.
</div> instead

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:77:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requesterEmail?.type === "required"
+              {false
                 ? "Requester email is required."
                 : null}
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Requester email is required\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:100:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.professorEmail?.type === "required" &&
-                "Professor email is required."}
+              {false}
               {errors.professorEmail?.type === "pattern" &&
                 "Enter a valid email address."}
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Professor email is required\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:102:16
             <Form.Control.Feedback type="invalid">
               {errors.professorEmail?.type === "required" &&
                 "Professor email is required."}
-              {errors.professorEmail?.type === "pattern" &&
-                "Enter a valid email address."}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: expected [ Array(1) ] to have a length of 2 but got 1

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:102:16
             <Form.Control.Feedback type="invalid">
               {errors.professorEmail?.type === "required" &&
                 "Professor email is required."}
-              {errors.professorEmail?.type === "pattern" &&
+              {true &&
                 "Enter a valid email address."}
             </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests renders correctly when passing in a RecommendationRequest
statusReason: Found multiple elements with the text: /id/

Here are the matching elements:

Ignored nodes: comments, script, style
<label
  class="form-label"
  for="id"

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:123:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.explanation?.type === "required"
+              {false
                 ? "Explanation is required."
                 : null}
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Explanation is required\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.jsx:169:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateNeeded?.type === "required"
+              {errors.dateNeeded.type === "required"
                 ? "Date needed is required."
                 : null}
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] EqualityOperator
main/components/RecommendationRequest/RecommendationRequestForm.jsx:169:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateNeeded?.type === "required"
+              {errors.dateNeeded?.type !== "required"
                 ? "Date needed is required."
                 : null}
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Date needed is required\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""
