[Killed] ArrowFunction
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:9:31
 
 export default function RecommendationRequestCreatePage({ storybook = false }) {
 
-  const objectToAxiosParams = (recommendationRequest) => ({
-    url: "/api/recommendationrequests/post",
-    method: "POST",
-    params: {
-      code: recommendationRequest.code,
-      requesterEmail: recommendationRequest.requesterEmail,
-      professorEmail: recommendationRequest.professorEmail,
-      explanation: recommendationRequest.explanation,
-      dateRequested: recommendationRequest.dateRequested + "Z",
-      dateNeeded: recommendationRequest.dateNeeded + "Z",
-      done: recommendationRequest.done,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (recommendationRequest) => {
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:23:48
     },
   });
 
-  const onSuccess = (recommendationRequest) => {
-    toast(
-      `New Recommendation Request Created - id: ${recommendationRequest.id} requester email: ${recommendationRequest.requesterEmail}`,
-    );
-  };
+  const onSuccess = (recommendationRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
main/pages/RecommendationRequest/RecommendationRequestCreatePage.jsx:25:7
 
   const onSuccess = (recommendationRequest) => {
     toast(
-      `New Recommendation Request Created - id: ${recommendationRequest.id} requester email: ${recommendationRequest.requesterEmail}`,
+      ``,
     );
   };
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "New Recommendation Request Created - id: 11 requester email: laurencho@ucsb.edu",
