[Killed] ArrowFunction
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:28:34
     },
   );
 
-  const objectToAxiosPutParams = (recommendationRequest) => ({
-    url: "/api/recommendationrequests",
-    method: "PUT",
-    params: {
-      id: recommendationRequest.id,
-    },
-    data: {
-      id: recommendationRequest.id,
-      code: recommendationRequest.code,
-      requesterEmail: recommendationRequest.requesterEmail,
-      professorEmail: recommendationRequest.professorEmail,
-      explanation: recommendationRequest.explanation,
-      dateRequested: recommendationRequest.dateRequested,
-      dateNeeded: recommendationRequest.dateNeeded,
-      done: recommendationRequest.done,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (_data, variables) => {
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "RecommendationRequest Updated - id: 11 code: laurenchorr",

[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:46:43
     },
   });
 
-  const onSuccess = (_data, variables) => {
-    toast(`RecommendationRequest Updated - id: ${id} code: ${variables.code}`);
-  };
+  const onSuccess = (_data, variables) => {};
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>
