[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.jsx:20:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/helprequest/edit/${cell.row.original.id}`);
+    navigate(``);
   };
 
killedBy: HelpRequestTable tests Edit button navigates to the edit page
statusReason: expected "spy" to be called with arguments: [ '/helprequest/edit/1' ]

Received: 

  1st spy call:

  [
-   "/helprequest/edit/1",
