[Killed] StringLiteral
main/components/Articles/ArticleForm.jsx:50:34
                     id="title"
                     type="text"
                     isInvalid={Boolean(errors.title)}
-                    {...register("title", {
+                    {...register("", {
                         required: "Title is required.",
                         maxLength: {
killedBy: ArticleForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/Articles/ArticleForm.jsx:59:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.title?.message}
+                    {errors.title.message}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: ArticleForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] OptionalChaining
main/components/Articles/ArticleForm.jsx:74:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.url?.message}
+                    {errors.url.message}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: ArticleForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ObjectLiteral
main/components/Articles/ArticleForm.jsx:84:49
                     id="explanation"
                     type="text"
                     isInvalid={Boolean(errors.name)}
-                    {...register("explanation", {
-                        required: "Explanation is required.",
-                    })}
+                    {...register("explanation", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: ArticleForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Explanation is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/Articles/ArticleForm.jsx:104:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.email?.message}
+                    {errors.email.message}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: ArticleForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] OptionalChaining
main/components/Articles/ArticleForm.jsx:120:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.dateAdded?.message}
+                    {errors.dateAdded.message}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: ArticleForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading 'message')
