[Killed] StringLiteral
main/components/Articles/ArticleTable.jsx:15:18
 export default function ArticleTable({
   articles,
   currentUser,
-  testIdPrefix = "ArticleTable",
+  testIdPrefix = "",
 }) {
   const navigate = useNavigate();
killedBy: ArticleTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="ArticleTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid=""

[Killed] BlockStatement
main/components/Articles/ArticleTable.jsx:19:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/articles/edit/${cell.row.original.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: ArticleTable tests Edit button navigates to the edit page
statusReason: expected "spy" to be called with arguments: [ '/articles/edit/8' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/Articles/ArticleTable.jsx:48:20
     },
     {
       header: "URL",
-      accessorKey: "url",
+      accessorKey: "",
     },
     {
killedBy: ArticleTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="ArticleTable-cell-row-0-col-url"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ArticleTable"

[Killed] ObjectLiteral
main/components/Articles/ArticleTable.jsx:58:5
       header: "Email",
       accessorKey: "email",
     },
-    {
-      header: "Date Added (iso format)",
-      accessorKey: "dateAdded",
-    },
+    {},
   ];
 
killedBy: ArticleTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Articles/ArticleTable.jsx:60:20
     },
     {
       header: "Date Added (iso format)",
-      accessorKey: "dateAdded",
+      accessorKey: "",
     },
   ];
killedBy: ArticleTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="ArticleTable-cell-row-0-col-dateAdded"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ArticleTable"
