[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:28:10
   return (
     <Form noValidate onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="RecommendationRequestForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {false}
         <Col>
           <Form.Group className="mb-3">
killedBy: RecommendationRequestForm tests renders correctly when passing in a RecommendationRequest
statusReason: Unable to find an element by: [data-testid="/RecommendationRequestForm-id/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:28:10
   return (
     <Form noValidate onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="RecommendationRequestForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {true}
         <Col>
           <Form.Group className="mb-3">
killedBy: RecommendationRequestForm tests renders correctly when passing in a RecommendationRequest
statusReason: Unable to find an element by: [data-testid="/RecommendationRequestForm-id/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:52:27
               type="text"
               isInvalid={Boolean(errors.code)}
               {...register("code", {
-                required: true,
+                required: false,
               })}
             />
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Code is required\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] EqualityOperator
main/components/RecommendationRequest/RecommendationRequestForm.jsx:56:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.code?.type === "required" ? "Code is required." : null}
+              {errors.code?.type !== "required" ? "Code is required." : null}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests No Error messsages on good input
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="invalid-feedback"
>
  Code is required.
</div> instead

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:56:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.code?.type === "required" ? "Code is required." : null}
+              {false ? "Code is required." : null}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Code is required\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:71:27
               type="email"
               isInvalid={Boolean(errors.requesterEmail)}
               {...register("requesterEmail", {
-                required: true,
+                required: false,
                 pattern: email_regex,
               })}
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Requester email is required\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.jsx:76:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requesterEmail?.type === "required"
+              {errors.requesterEmail.type === "required"
                 ? "Requester email is required."
                 : null}
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] EqualityOperator
main/components/RecommendationRequest/RecommendationRequestForm.jsx:76:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requesterEmail?.type === "required"
+              {errors.requesterEmail?.type !== "required"
                 ? "Requester email is required."
                 : null}
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Requester email is required\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:79:16
               {errors.requesterEmail?.type === "required"
                 ? "Requester email is required."
                 : null}
-              {errors.requesterEmail?.type === "pattern"
+              {true
                 ? "Enter a valid email address."
                 : null}
killedBy: RecommendationRequestForm tests No Error messsages on good input
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="invalid-feedback"
>
  Enter a valid email address.
</div> instead

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.jsx:79:16
               {errors.requesterEmail?.type === "required"
                 ? "Requester email is required."
                 : null}
-              {errors.requesterEmail?.type === "pattern"
+              {errors.requesterEmail.type === "pattern"
                 ? "Enter a valid email address."
                 : null}
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:80:19
                 ? "Requester email is required."
                 : null}
               {errors.requesterEmail?.type === "pattern"
-                ? "Enter a valid email address."
+                ? ""
                 : null}
             </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: expected [ Array(1) ] to have a length of 2 but got 1

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:94:27
               type="email"
               isInvalid={Boolean(errors.professorEmail)}
               {...register("professorEmail", {
-                required: true,
+                required: false,
                 pattern: email_regex,
               })}
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Professor email is required\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] EqualityOperator
main/components/RecommendationRequest/RecommendationRequestForm.jsx:99:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.professorEmail?.type === "required" &&
+              {errors.professorEmail?.type !== "required" &&
                 "Professor email is required."}
               {errors.professorEmail?.type === "pattern" &&
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Professor email is required\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.jsx:99:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.professorEmail?.type === "required" &&
+              {errors.professorEmail.type === "required" &&
                 "Professor email is required."}
               {errors.professorEmail?.type === "pattern" &&
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:100:17
             />
             <Form.Control.Feedback type="invalid">
               {errors.professorEmail?.type === "required" &&
-                "Professor email is required."}
+                ""}
               {errors.professorEmail?.type === "pattern" &&
                 "Enter a valid email address."}
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Professor email is required\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.jsx:101:16
             <Form.Control.Feedback type="invalid">
               {errors.professorEmail?.type === "required" &&
                 "Professor email is required."}
-              {errors.professorEmail?.type === "pattern" &&
-                "Enter a valid email address."}
+              {errors.professorEmail?.type === "pattern" || "Enter a valid email address."}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: expected [ Array(1) ] to have a length of 2 but got 1

[Killed] EqualityOperator
main/components/RecommendationRequest/RecommendationRequestForm.jsx:101:16
             <Form.Control.Feedback type="invalid">
               {errors.professorEmail?.type === "required" &&
                 "Professor email is required."}
-              {errors.professorEmail?.type === "pattern" &&
+              {errors.professorEmail?.type !== "pattern" &&
                 "Enter a valid email address."}
             </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: expected [ Array(1) ] to have a length of 2 but got 1

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:102:17
               {errors.professorEmail?.type === "required" &&
                 "Professor email is required."}
               {errors.professorEmail?.type === "pattern" &&
-                "Enter a valid email address."}
+                ""}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: expected [ Array(1) ] to have a length of 2 but got 1

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:117:43
               data-testid="RecommendationRequestForm-explanation"
               id="explanation"
               isInvalid={Boolean(errors.explanation)}
-              {...register("explanation", {
-                required: true, // ← removed minLength
-              })}
+              {...register("explanation", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Explanation is required\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:118:27
               id="explanation"
               isInvalid={Boolean(errors.explanation)}
               {...register("explanation", {
-                required: true, // ← removed minLength
+                required: false, // ← removed minLength
               })}
             />
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Explanation is required\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.jsx:122:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.explanation?.type === "required"
+              {errors.explanation.type === "required"
                 ? "Explanation is required."
                 : null}
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:122:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.explanation?.type === "required"
+              {true
                 ? "Explanation is required."
                 : null}
killedBy: RecommendationRequestForm tests No Error messsages on good input
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="invalid-feedback"
>
  Explanation is required.
</div> instead

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:141:28
               id="dateRequested"
               type="datetime-local"
               isInvalid={Boolean(errors.dateRequested)}
-              {...register("dateRequested", {
+              {...register("", {
                 required: true,
                 pattern: isodate_regex,
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] EqualityOperator
main/components/RecommendationRequest/RecommendationRequestForm.jsx:147:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateRequested?.type === "required"
+              {errors.dateRequested?.type !== "required"
                 ? "Date requested is required."
                 : null}
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Date requested is required\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:147:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateRequested?.type === "required"
+              {false
                 ? "Date requested is required."
                 : null}
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Date requested is required\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:148:19
             />
             <Form.Control.Feedback type="invalid">
               {errors.dateRequested?.type === "required"
-                ? "Date requested is required."
+                ? ""
                 : null}
               {/* {errors.dateRequested?.type === "pattern"  ? "Use ISO format." : null} */}
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Date requested is required\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:168:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateNeeded?.type === "required"
+              {true
                 ? "Date needed is required."
                 : null}
killedBy: RecommendationRequestForm tests No Error messsages on good input
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="invalid-feedback"
>
  Date needed is required.
</div> instead

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:168:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateNeeded?.type === "required"
+              {false
                 ? "Date needed is required."
                 : null}
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Date needed is required\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:169:19
             />
             <Form.Control.Feedback type="invalid">
               {errors.dateNeeded?.type === "required"
-                ? "Date needed is required."
+                ? ""
                 : null}
               {/* {errors.dateNeeded?.type === "pattern"  ? "Use ISO format." : null} */}
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Date needed is required\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestForm.jsx:194:22
           </Button>
           <Button
             variant="secondary"
-            onClick={() => navigate(-1)}
+            onClick={() => undefined}
             data-testid="RecommendationRequestForm-cancel"
           >
killedBy: RecommendationRequestForm tests that navigate(-1) is called when Cancel is clicked
statusReason: expected "spy" to be called with arguments: [ -1 ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] UnaryOperator
main/components/RecommendationRequest/RecommendationRequestForm.jsx:194:37
           </Button>
           <Button
             variant="secondary"
-            onClick={() => navigate(-1)}
+            onClick={() => navigate(+1)}
             data-testid="RecommendationRequestForm-cancel"
           >
killedBy: RecommendationRequestForm tests that navigate(-1) is called when Cancel is clicked
statusReason: expected "spy" to be called with arguments: [ -1 ]

Received: 

  1st spy call:

  [
-   -1,
