[Killed] ConditionalExpression
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsForm.jsx:26:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="UCSBDiningCommonsMenuItemsForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {false}
 
         <Col>
killedBy: UCSBDiningCommonsMenuItemsForm tests renders correctly when passing in a UCSBDiningCommonsMenuItems
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemsForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsForm.jsx:26:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="UCSBDiningCommonsMenuItemsForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {initialContents || <Col>
+            <Form.Group className="mb-3">
+              <Form.Label htmlFor="id">Id</Form.Label>
+              <Form.Control data-testid="UCSBDiningCommonsMenuItemsForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+            </Form.Group>
+          </Col>}
 
         <Col>
killedBy: UCSBDiningCommonsMenuItemsForm tests renders correctly
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BooleanLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsForm.jsx:52:26
               id="diningCommonsCode"
               type="text"
               placeholder="ortega"
-              isInvalid={!!errors.diningCommonsCode}
+              isInvalid={!errors.diningCommonsCode}
               {...register("diningCommonsCode", {
                 required: "diningCommonsCode is required.",
killedBy: UCSBDiningCommonsMenuItemsForm tests diningCommonsCode field shows error styling when there's an error
statusReason: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsForm.jsx:53:28
               type="text"
               placeholder="ortega"
               isInvalid={!!errors.diningCommonsCode}
-              {...register("diningCommonsCode", {
+              {...register("", {
                 required: "diningCommonsCode is required.",
                 pattern: {
killedBy: UCSBDiningCommonsMenuItemsForm tests renders correctly
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] Regex
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsForm.jsx:56:26
               {...register("diningCommonsCode", {
                 required: "diningCommonsCode is required.",
                 pattern: {
-                  value: /^[A-Za-z]+$/,
+                  value: /^[A-Za-z]$/,
                   message: "diningCommonsCode must be in the format String",
                 },
killedBy: UCSBDiningCommonsMenuItemsForm tests No Error messages on good input
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] Regex
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsForm.jsx:56:26
               {...register("diningCommonsCode", {
                 required: "diningCommonsCode is required.",
                 pattern: {
-                  value: /^[A-Za-z]+$/,
+                  value: /[A-Za-z]+$/,
                   message: "diningCommonsCode must be in the format String",
                 },
killedBy: UCSBDiningCommonsMenuItemsForm tests Correct Error messages on bad input
statusReason: Unable to find an element with the text: /diningCommonsCode must be in the format String/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsForm.jsx:74:26
               id="name"
               type="text"
               placeholder="pasta"
-              isInvalid={!!errors.name}
+              isInvalid={!errors.name}
               {...register("name", {
                 required: "Name is required.",
killedBy: UCSBDiningCommonsMenuItemsForm tests name field shows error styling when there's an error
statusReason: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] BooleanLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsForm.jsx:95:27
               id="station"
               type="text"
               placeholder="italian"
-              isInvalid={!!errors.station}
+              isInvalid={!errors.station}
               {...register("station", {
                 required: "Station is required.",
killedBy: UCSBDiningCommonsMenuItemsForm tests station field shows error styling when there's an error
statusReason: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsForm.jsx:97:27
               placeholder="italian"
               isInvalid={!!errors.station}
               {...register("station", {
-                required: "Station is required.",
+                required: "",
               })}
             />
killedBy: UCSBDiningCommonsMenuItemsForm tests Correct Error messages on missing input
statusReason: Unable to find an element with the text: /Station is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
