[Killed] BlockStatement
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsTable.jsx:18:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/ucsbdiningcommons/edit/${cell.row.original.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: expected "spy" to be called with arguments: [ '/ucsbdiningcommons/edit/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ArrayDeclaration
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsTable.jsx:36:19
     deleteMutation.mutate(cell);
   };
 
-  const columns = [
-    {
-      header: "id",
-      accessorKey: "id", // accessor is the "key" in the data
-    },
-    {
-      header: "diningCommonsCode",
-      accessorKey: "diningCommonsCode",
-    },
-    {
-      header: "Name",
-      accessorKey: "name",
-    },
-    {
-      header: "Station",
-      accessorKey: "station",
-    },
-  ];
+  const columns = [];
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBDiningCommonsMenuItemsTable"

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsTable.jsx:41:5
       header: "id",
       accessorKey: "id", // accessor is the "key" in the data
     },
-    {
-      header: "diningCommonsCode",
-      accessorKey: "diningCommonsCode",
-    },
+    {},
     {
       header: "Name",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsTable.jsx:58:9
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(
       ButtonColumn(
-        "Edit",
+        "",
         "primary",
         editCallback,
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsTable.jsx:67:9
     columns.push(
       ButtonColumn(
         "Delete",
-        "danger",
+        "",
         deleteCallback,
         "UCSBDiningCommonsMenuItemsTable",
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsTable.jsx:69:9
         "Delete",
         "danger",
         deleteCallback,
-        "UCSBDiningCommonsMenuItemsTable",
+        "",
       ),
     );
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemsTable-cell-row-0-col-Delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBDiningCommonsMenuItemsTable"

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsTable.jsx:78:15
     <OurTable
       data={items}
       columns={columns}
-      testid={"UCSBDiningCommonsMenuItemsTable"}
+      testid={""}
     />
   );
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemsTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid=""
