[Killed] BlockStatement
main/pages/Articles/ArticlesCreatePage.jsx:3:46
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function ArticlesCreatePage() {
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function ArticlesCreatePage() {}
 
killedBy: ArticlesCreatePage tests Renders expected content
statusReason: Unable to find an element with the text: Create page not yet implemented. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
