[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:57:14
               })}
             />
             <Form.Control.Feedback type="invalid">
-            {errors.code?.type === "required" ? "Code is required." : null}
+            {true ? "Code is required." : null}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Requester email is required\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.jsx:57:14
               })}
             />
             <Form.Control.Feedback type="invalid">
-            {errors.code?.type === "required" ? "Code is required." : null}
+            {errors.code.type === "required" ? "Code is required." : null}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:77:14
               })}
             />
             <Form.Control.Feedback type="invalid">
-            {errors.requesterEmail?.type === "required" ? "Requester email is required." : null}
+            {false ? "Requester email is required." : null}
             {errors.requesterEmail?.type === "pattern"  ? "Enter a valid email address." : null}
             </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Requester email is required\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] EqualityOperator
main/components/RecommendationRequest/RecommendationRequestForm.jsx:77:14
               })}
             />
             <Form.Control.Feedback type="invalid">
-            {errors.requesterEmail?.type === "required" ? "Requester email is required." : null}
+            {errors.requesterEmail?.type !== "required" ? "Requester email is required." : null}
             {errors.requesterEmail?.type === "pattern"  ? "Enter a valid email address." : null}
             </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Requester email is required\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:78:14
             />
             <Form.Control.Feedback type="invalid">
             {errors.requesterEmail?.type === "required" ? "Requester email is required." : null}
-            {errors.requesterEmail?.type === "pattern"  ? "Enter a valid email address." : null}
+            {false  ? "Enter a valid email address." : null}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: expected [ Array(1) ] to have a length of 2 but got 1

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.jsx:78:14
             />
             <Form.Control.Feedback type="invalid">
             {errors.requesterEmail?.type === "required" ? "Requester email is required." : null}
-            {errors.requesterEmail?.type === "pattern"  ? "Enter a valid email address." : null}
+            {errors.requesterEmail.type === "pattern"  ? "Enter a valid email address." : null}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:96:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.professorEmail?.type === "required" && "Professor email is required."}
+              {true}
               {errors.professorEmail?.type === "pattern" && "Enter a valid email address."}
             </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Professor email is required\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:96:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.professorEmail?.type === "required" && "Professor email is required."}
+              {true && "Professor email is required."}
               {errors.professorEmail?.type === "pattern" && "Enter a valid email address."}
             </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests No Error messsages on good input
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="invalid-feedback"
>
  Professor email is required.
</div> instead

[Killed] EqualityOperator
main/components/RecommendationRequest/RecommendationRequestForm.jsx:97:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.professorEmail?.type === "required" && "Professor email is required."}
-              {errors.professorEmail?.type === "pattern" && "Enter a valid email address."}
+              {errors.professorEmail?.type !== "pattern" && "Enter a valid email address."}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: expected [ Array(1) ] to have a length of 2 but got 1

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:97:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.professorEmail?.type === "required" && "Professor email is required."}
-              {errors.professorEmail?.type === "pattern" && "Enter a valid email address."}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: expected [ Array(1) ] to have a length of 2 but got 1

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.jsx:117:14
             })}
             />
             <Form.Control.Feedback type="invalid">
-            {errors.explanation?.type === "required" ? "Explanation is required." : null}
+            {errors.explanation.type === "required" ? "Explanation is required." : null}
             {/* removed minLength message */}
             </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:117:14
             })}
             />
             <Form.Control.Feedback type="invalid">
-            {errors.explanation?.type === "required" ? "Explanation is required." : null}
+            {true ? "Explanation is required." : null}
             {/* removed minLength message */}
             </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests No Error messsages on good input
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="invalid-feedback"
>
  Explanation is required.
</div> instead

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:138:14
               })}
             />
             <Form.Control.Feedback type="invalid">
-            {errors.dateRequested?.type === "required" ? "Date requested is required." : null}
+            {false ? "Date requested is required." : null}
             {/* {errors.dateRequested?.type === "pattern"  ? "Use ISO format." : null} */}
             </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Date requested is required\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] EqualityOperator
main/components/RecommendationRequest/RecommendationRequestForm.jsx:138:14
               })}
             />
             <Form.Control.Feedback type="invalid">
-            {errors.dateRequested?.type === "required" ? "Date requested is required." : null}
+            {errors.dateRequested?.type !== "required" ? "Date requested is required." : null}
             {/* {errors.dateRequested?.type === "pattern"  ? "Use ISO format." : null} */}
             </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Date requested is required\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:157:14
               })}
             />
             <Form.Control.Feedback type="invalid">
-            {errors.dateNeeded?.type === "required" ? "Date needed is required." : null}
+            {false ? "Date needed is required." : null}
             {/* {errors.dateNeeded?.type === "pattern"  ? "Use ISO format." : null} */}
             </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Date needed is required\./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.jsx:157:14
               })}
             />
             <Form.Control.Feedback type="invalid">
-            {errors.dateNeeded?.type === "required" ? "Date needed is required." : null}
+            {errors.dateNeeded.type === "required" ? "Date needed is required." : null}
             {/* {errors.dateNeeded?.type === "pattern"  ? "Use ISO format." : null} */}
             </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:170:26
             id="done"
             label="Done"
             data-testid="RecommendationRequestForm-done"
-            {...register("done")}
+            {...register("")}
           />
         </Col>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Cannot read properties of undefined (reading '_f')
