[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestsTable.jsx:44:5
     { header: "Explanation", accessorKey: "explanation" },
     { header: "Date Requested", accessorKey: "dateRequested" },
     { header: "Date Needed", accessorKey: "dateNeeded" },
-    { header: "Done", accessorKey: "done" },
+    {},
   ];
 
killedBy: RecommendationRequestsTable tests Has the expected column headers and content for ordinary user
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestsTable.jsx:44:36
     { header: "Explanation", accessorKey: "explanation" },
     { header: "Date Requested", accessorKey: "dateRequested" },
     { header: "Date Needed", accessorKey: "dateNeeded" },
-    { header: "Done", accessorKey: "done" },
+    { header: "Done", accessorKey: "" },
   ];
 
killedBy: RecommendationRequestsTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="RecommendationRequestsTable-cell-row-0-col-done"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecommendationRequestsTable"
